Портал_EDT/src/DataProcessors/Аук_РабочийСтолАукционы/Аук_РабочийСтолАукционы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Аук_РабочийСтолАукционы</name>
</mdclass:DataProcessor>

Портал_EDT/src/Catalogs/Аук_ВидыАукционов/Аук_ВидыАукционов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Аук_ВидыАукционов</name>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.Аук_ВидыОперацийАукционов</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Аук_ПродуктыАукционов</types>
    </type>
  </attributes>
  <attributes>
    <name>СРаспределениемСуммы</name>
    <comment>Признак того, что при подведении итогов по аукциону данного вида будет использоваться распределение суммы аукциона</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоЗначенийСтруктурыСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоЗначенийСтруктурыВводныхДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПромежуточныйИтогВариантВыбора</name>
    <comment>0 - Минимум, 1 - Максимум</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПромежуточныйИтогФормула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПромежуточныйИтогШаблонРезультата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончательныйИтогФормула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончательныйИтогРаспределяемаяСуммаОсновная</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончательныйИтогРаспределяемаяСуммаДополнительная</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураСтавки</name>
    <attributes>
      <name>ЭлементСтавки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Аук_ЭлементыДанныхАукционов</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОбязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтруктураНачальныхДанных</name>
    <attributes>
      <name>ЭлементДанных</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Аук_ЭлементыДанныхАукционов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПоУмолчанию</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьЧасы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Портал_EDT/src/DataProcessors/Аук_РабочийСтолАукционы/Forms/ВводСтавкиУчастника/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачальнаяИнициализация();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого ЭлМас Из ЭтотОбъект.РеквизитыСПроверкойЗаполнения Цикл
		ПроверяемыеРеквизиты.Добавить(ЭлМас);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьИнтерфейс();
	
	СоздатьПервуюСтроку();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокЗначенийСтавкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		НовСтрока = ЭтотОбъект.СписокЗначенийСтавки.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		
		Для Каждого ЭлСоо Из ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами Цикл
			НовСтрока["Характеристика" + ЭлСоо.Ключ] = ЭлСоо.Значение;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийСтавкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Не ЭтотОбъект.НесколькоЗначенийСтруктурыСтавки;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийСтавкиПередУдалением(Элемент, Отказ)
	
	Отказ = Не ЭтотОбъект.НесколькоЗначенийСтруктурыСтавки;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	Аук_ОбщийКлиент.НачатьВыборУчастника(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Аук_ОбщийКлиент.НачатьВыборКонтактногоЛица(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникОчистка(Элемент, СтандартнаяОбработка)
	
	ЭтотОбъект.КонтактноеЛицо = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникПриИзменении(Элемент)

	Аук_ОбщийКлиент.УчастникПриИзменении(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Принять(Команда)
	ЗафиксироватьИнформациюОтУчастников();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьПервуюСтроку() 
	
	НовСтрока = ЭтотОбъект.СписокЗначенийСтавки.Добавить();
	
	Для Каждого ЭлСоо Из ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами Цикл
		НовСтрока["Характеристика" + ЭлСоо.Ключ] = ЭлСоо.Значение;	
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗафиксироватьИнформациюОтУчастников()
	
	Если ПроверитьЗаполнение() Тогда
		
		Закрыть(ДанныеСтавкиИзДанныхФормы());
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеСтавкиИзДанныхФормы()
	
	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Аукцион",		ЭтотОбъект.Аукцион);
	сткРезультат.Вставить("Участник",		ЭтотОбъект.Участник);
	сткРезультат.Вставить("КонтактноеЛицо",	ЭтотОбъект.КонтактноеЛицо);
	
	масРеквизитыСтавки = Аук_ОбщийКлиентСервер.КлючиКоллекцииВМассив(ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами);
	сткРезультат.Вставить("Данные",	Аук_ОбщийКлиент.ДанныеСтавкиВМассивСтруктур(ЭтотОбъект.СписокЗначенийСтавки, масРеквизитыСтавки));
	
	Возврат сткРезультат;
	
КонецФункции	

&НаКлиенте
Процедура НастроитьИнтерфейс()
	
	Элементы.СписокЗначенийСтавки.КоманднаяПанель.Видимость = ЭтотОбъект.НесколькоЗначенийСтруктурыСтавки;
	//Элементы.СписокЗначенийСтавки.КоманднаяПанель.ПодчиненныеЭлементы.СписокЗначенийСтавкиПереместить.Видимость = ЭтотОбъект.НесколькоЗначенийСтруктурыСтавки;
		
КонецПроцедуры

&НаСервере
Процедура НачальнаяИнициализация()
	
	ЭтотОбъект.Аукцион	= Параметры.Аукцион;
	
	Аук_ОбщийСервер.ЗаполнитьДанныеДляОтборовНаФорме(ЭтотОбъект);
	
	Аук_ОбщийСервер.ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(ЭтотОбъект, Параметры.ВидАукциона, "СписокЗначенийСтавки");
	
	ЗаполнитьДляПроверкиЗаполнения();
		
	ЭтотОбъект.НесколькоЗначенийСтруктурыСтавки	= Справочники.Аук_ВидыАукционов.ОписаниеНастроекСтавокПоВидуАукциона(Параметры.ВидАукциона).НесколькоЗначенийСтруктурыСтавки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДляПроверкиЗаполнения()
	
	масСтруктураСтавки = Справочники.Аук_ВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(Параметры.ВидАукциона);
	
	сооСвязьЭлементовСтавкиСРеквизитами = Новый Соответствие;
	масРеквизитыСПроверкойЗаполнения = Новый Массив;
	
	Для Каждого сткЭлемент Из масСтруктураСтавки Цикл
		сооСвязьЭлементовСтавкиСРеквизитами.Вставить(сткЭлемент.ТехническоеНаименование, сткЭлемент.Элемент);
		
		Если Не сткЭлемент.НеОбязательный Тогда
			масРеквизитыСПроверкойЗаполнения.Добавить("СписокЗначенийСтавки." + сткЭлемент.ТехническоеНаименование);
		КонецЕсли;
	КонецЦикла;
	
	ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами = Новый ФиксированноеСоответствие(сооСвязьЭлементовСтавкиСРеквизитами);
	
	ЭтотОбъект.РеквизитыСПроверкойЗаполнения	= Новый ФиксированныйМассив(масРеквизитыСПроверкойЗаполнения);
		
КонецПроцедуры

#КонецОбласти
